[
  {
    "title": "Keka, our new HRMS Solution for efficient organization management",
    "content": "Comments:\n  We are solving HRMS requirement using Keka and so far we are very convinced with the quality of product, it supplies every functionality as promised. So we are now moving all our assets to keka and making it our HRMS Software for Full time\n\n\n    \n\n\n    Pros:\n  Keka comes with many such features which helps any organization to manage their staff efficiently.\nLike I daily use keka to mark my attendance in my company, I start my day as a Work from home (remote working ) employee, first I clock in using Web Clock  provided in the KEKA. It automatically manage my attendance and leave balance maintenance, also it takes care of my payroll and pay slips. it helps HR to seamlessly manage tickets raised by the employee like us and resolve the matter. it also comes with a profile management, where we can upload necessary document for ease of access during the time of work.\n    \n\n\n    Cons:\n  I first of all found the UI of software very clumsy, it is very clear no doubt , but it is very populated and use of animal characters in UI like elephant in leave management seems very childish. also the loading time of web based solution is very slow, like we have subdomain knovator.keke.com/  it is very slow and takes up too much time to load all settings. \nAlso web clock can be enhanced more, as it must be given a pause functionality because we have flexible working hours.",
    "time": "4 years ago",
    "rating": 4,
    "reviewerName": "Shaunak",
    "source": "Capterra"
  },
  {
    "title": "Keka is the good solution for your business.  It can automate your Human Resources unit easily.",
    "content": "Comments:\n  One of the best automation HR/Payroll systems available and it is being using across the world.\n\n\n    \n\n\n    Pros:\n  Great with the 1:1 meeting process as rare applications work with remote employees, The analytics are great with all the available diagrams.\n    \n\n\n    Cons:\n  Still there is a gap with integration with other software and data.\n    Alternatives Considered:\n    \n    MenaHR Curio\n  \n    \n      Reasons for Choosing Keka:\n    \n    The remote management option is wonderful with the 1:1 meeting.  More automation features are available in this product.\n  \n    Switched From:\n    \n    ZenHR\n  \n    \n      Reasons for Switching to Keka:\n    \n    Customer support is much better.  MenaHR is not still mature as it keeps on hanging at times and data is corrupted therefore backup has to take place from time to time.",
    "time": "2 years ago",
    "rating": 4,
    "reviewerName": "Mohammad",
    "source": "Capterra"
  },
  {
    "title": "Does the bare minimum; inflexible and customer service is poor",
    "content": "Comments:\n  Overall experience is average. If you are looking for a basic HR automation software, it is ok but if you have any processes that need a little flexibility within the software or some tweaks from the normal, you are out of luck. Change is painfully slow and customer service is abysmal.\n\n\n    \n\n\n    Pros:\n  Basic HR automation features are all included\n    \n\n\n    Cons:\n  Lot of the functionality is hard wired; impossible to make any changes. You have to wire your process to fit Keka. Customer Service is very poor. Most times, they dont understand the issue and ask to re-do activity. For example; some issue with Timesheet module; their solution, ask employees to re-submit all Timesheets for last 2 week.",
    "time": "2 years ago",
    "rating": 3,
    "reviewerName": "Puneet",
    "source": "Capterra"
  },
  {
    "title": "Cost effective Hr& Payroll Management tool",
    "content": "Comments:\n  Good tool for Mid and Start-up level companies, as it has many payroll management features.But large companies not suggetsed\n\n\n    \n\n\n    Pros:\n  Remote Log in & Log out time management systemEasy to use mobile app\n    \n\n\n    Cons:\n  Leaves and vacations *parts are little confusing\n    Alternatives Considered:\n    \n    TrackSmart Attendance and Workday HCM\n  \n    \n      Reasons for Switching to Keka:\n    \n    Coat effective and good for , mid-level companies compare to other similar tools",
    "time": "2 years ago",
    "rating": 4,
    "reviewerName": "Bhushan",
    "source": "Capterra"
  },
  {
    "title": "User friendly software",
    "content": "Comments:\n  Good experience using the product. Will continue so\n\n\n    \n\n\n    Pros:\n  Very easy to navigate, set up. Any issues are solved instantly. Customer support is good.\n    \n\n\n    Cons:\n  Sometimes our employees find it difficult to navigate through the payroll information. Expenses and payroll management module, document repository can be improved.\n    Alternatives Considered:\n    \n    Darwinbox\n  \n    \n      Reasons for Switching to Keka:\n    \n    User friendly, Support, We knew the team and recommended by others.",
    "time": "5 years ago",
    "rating": 4,
    "reviewerName": "Verified Reviewer",
    "source": "Capterra"
  },
  {
    "title": "Its very Easy to Use and Low cost",
    "content": "Pros:\n  I Manage my data easily and very attractive dashboard\n    \n\n\n    Cons:\n  I am using Keka since to more then 1 year i have good experience its very useful product, I can reduce my time that's why i Use Keka",
    "time": "11 months ago",
    "rating": 5,
    "reviewerName": "Raushan",
    "source": "Capterra"
  },
  {
    "title": "Human Resource Management",
    "content": "Pros:\n  Tracking on Keka is super easy , so as the interface of the application , also marking absebse or leaves are easy as well.\n    \n\n\n    Cons:\n  glitches , recently i have faced a issue where i am not able to log in due to software glitch although that has been resolved later on but still thAT issue should not come",
    "time": "last year",
    "rating": 4,
    "reviewerName": "Rishabh",
    "source": "Capterra"
  },
  {
    "title": "Mostly used tool in our organisation for reviews and attendance",
    "content": "Comments:\n  Been using Keka for almost 2 years now and thoroughly know about the tool.\n\n\n    \n\n\n    Pros:\n  Everything can be tracked starting form your location for login in to login out. Also leave management is trackable along with approximate pay for next month is shown along with tax deductions. Also reviews are available which an employee can refer to anytime they want.\n    \n\n\n    Cons:\n  Capturing the location, now this is from employee prospective not from HR. Joking!!",
    "time": "2 years ago",
    "rating": 4,
    "reviewerName": "Verified Reviewer",
    "source": "Capterra"
  },
  {
    "title": "Keka is the Best Way to Establish a Successful Business",
    "content": "Comments:\n  Keka is the best way to make your company amazing. It automates human procedures and creates a motivated culture. The straightforward UI and easy-to-use features make data-driven decisions easier, and the potential to decrease boring activities is invaluable. I really recommend Keka for building a wonderful company.\n\n\n    \n\n\n    Pros:\n  Keka has transformed my HR management. Keka handles hiring, performance management, and data analytics for my company's people procedures. Keka lets me automate routine work and focus on strategy. The simple design and features make data-driven decisions easier. Keka's strongest strength is its culture of engagement and drive.\n    \n\n\n    Cons:\n  I have not come across any significant issues with Keka so far. However, the only downside is that it might take some time to get used to the platform's features and functionalities. But once you get the hang of it, Keka is a breeze to use.",
    "time": "2 years ago",
    "rating": 5,
    "reviewerName": "Manisha",
    "source": "Capterra"
  },
  {
    "title": "My review of keka",
    "content": "Comments:\n  Overall it's a good software for payroll management and employee mangement.it is not too much pricey and has many cool features\n\n\n    \n\n\n    Pros:\n  It's attendence tracking and programs time tracking efficiency is very good.The mobile app version is very attractive and very easy to navigate.The price is quite good compared to its competitors.\n    \n\n\n    Cons:\n  Too many features makes the app clumsy to use.It also should improve other tracking features like data and performance scaling etc",
    "time": "2 years ago",
    "rating": 5,
    "reviewerName": "Alekhya",
    "source": "Capterra"
  },
  {
    "title": "Best tool for attendance and leave tracking",
    "content": "Comments:\n  It becomes extremely difficult for anyone to keep track of their log in and log out and land up getting pay cut due to half day. Keka has helped me know the time of punch in and out and I don't get salary cuts\n\n\n    \n\n\n    Pros:\n  Keka has a unique feature of tracking your attendance ,your log in and log out time with benefits of applying leave and checking balance of your leave. It is so simple that without even training any person would be able to understand the usage. Not only that in keka I can know about birthday,years of completion, finance related summary and our pay slip. U like other tool downloading pay slip is easier with no complication of multiple times password protection\n    \n\n\n    Cons:\n  I think keka should have multiple months download for payslip.",
    "time": "2 years ago",
    "rating": 5,
    "reviewerName": "Shruti",
    "source": "Capterra"
  },
  {
    "title": "Good HR payroll software",
    "content": "Pros:\n  Keka has user-friendly interface for centralised HR management. Automates payroll, offers real-time reports, compliance features, and data security. Integration support and scalable for businesses of all sizes.I love using this app.\n    \n\n\n    Cons:\n  As a negative, I would blame the limited customisation and the limited mobile application.",
    "time": "last year",
    "rating": 5,
    "reviewerName": "Viktor",
    "source": "Capterra"
  },
  {
    "title": "Keka - all your needs under one platform",
    "content": "Pros:\n  An Intuitive and easy user interface is the first pro of Keka. I have used other hr platforms and Keka has been the easiest to use. Leave applying and attendance tracking could be easily done and managed. Also, showing whether a colleague is in or out the office is another amazing feature.\n    \n\n\n    Cons:\n  There should be an option to modify/delete your leave requests. Also, there has been issue with Tax calculation too often. Otherwise, keka has been so far a good platform, and no particular dislikes from me.",
    "time": "2 years ago",
    "rating": 5,
    "reviewerName": "Verified Reviewer",
    "source": "Capterra"
  },
  {
    "title": "Best HR Management Tool for Employees and Management",
    "content": "Comments:\n  Overall experience with Keka is satisfying because it offers too much to get the job done. Keka is helpful for both employees and employers/HRs. It records everything to maintain a smooth work system within the organization.\n\n\n    \n\n\n    Pros:\n  Keka offers a lot of features to automate the entire process from requirement to joining. It has customized templates to send mail to employees, it has time tracking and attendance registry within the software which makes it easy for the employee to track time. it has an option to apply leave electronically which makes the process even smoother.\n    \n\n\n    Cons:\n  Keka has some features missing such as workflow management system and files management system. It does not offer workflow management system to work collaboratively with the team by sharing documents internally because that feature is not available too.",
    "time": "3 years ago",
    "rating": 5,
    "reviewerName": "Verified Reviewer",
    "source": "Capterra"
  },
  {
    "title": "Keka Review",
    "content": "Pros:\n  It's user friendly. Easy to find things. Great report generation.\n    \n\n\n    Cons:\n  Limited features in exit process. Required features are difficult to add on the software\n    Alternatives Considered:\n    \n    Darwinbox\n  \n    \n      Reasons for Switching to Keka:\n    \n    Price",
    "time": "3 years ago",
    "rating": 5,
    "reviewerName": "Verified Reviewer",
    "source": "Capterra"
  },
  {
    "title": "Good and cheap HRMS",
    "content": "Pros:\n  Keka has all the features that a good HRMS must have.\nThe interface is good. Leave management is awesome.\nThe tax and payroll module is also nice and integration with clear tax is great.\n    \n\n\n    Cons:\n  The interface can be made faster and more consistent.\nIntegrations can be added with other third parties like slack.",
    "time": "3 years ago",
    "rating": 5,
    "reviewerName": "Pranav",
    "source": "Capterra"
  },
  {
    "title": "Feature packed HR tech software",
    "content": "Pros:\n  The best thing Keka is probably its complete HR tech package which includes attendance management (remote login, web login, integration from RFID or biometric based attendance management systems), team management, OKR settings, review submissions, feedback submissions, appraisal management etc.\n\nManagement of payroll and taxes is also enabled and their is integration with ClearTax as well to facilitate IT return filing.\n    \n\n\n    Cons:\n  While the tool is full of features I have found it difficult to traverse. Even the features which I have used in past and if I come back to them I have to spend good time to search for them especially in the finances module.",
    "time": "3 years ago",
    "rating": 4,
    "reviewerName": "Ravi",
    "source": "Capterra"
  },
  {
    "title": "The best archiver/unarchiver for Mac!",
    "content": "Comments:\n  We depend on Keka nearly every day. Our cloud storage at box.com is limited to files under 5gb. Because we often have InDesign source files larger than this, we have to split the archives in order to store them in the cloud. Keka makes this super easy and is very reliable with great 7zip compression among other multi-part file splitting formats.\n\n\n    \n\n\n    Pros:\n  Keka is fantastic. We depend on it almost every day. Oh, and also, their isopod logo/icon is pretty great too.\n    \n\n\n    Cons:\n  The single most important improvement that Keka needs is the ability to *create* RAR files. It extracts them perfectly fine, but I understand that due to licensing issues they are unable to implement RAR creation into the software. There was an ancient beta version that did this which you can search out, but the RAR files it creates are unreliable. That's the only negative I can find about the great little piece of software.",
    "time": "4 years ago",
    "rating": 5,
    "reviewerName": "Michael",
    "source": "Capterra"
  },
  {
    "title": "My Keka Review",
    "content": "Pros:\n  Keka is the best HRMS portal.\nIt have many options like Payroll, Leave, expenses, attandance etc.\nWe can easily track these.\n    \n\n\n    Cons:\n  There are no cons in this.\nThis is very essential for my daily login and logout.",
    "time": "3 years ago",
    "rating": 5,
    "reviewerName": "Usman",
    "source": "Capterra"
  },
  {
    "title": "The worst software and even worse customer care",
    "content": "Comments:\n  horrible.\n\n\n    \n\n\n    Pros:\n  absolutely nothing.  it's badly designed.  and if you contact the customer service for help, they don't know how to help you.\n    \n\n\n    Cons:\n  it's not user friendly.  the customer service is abysmal.  They only have one way to solve everything and that's by telling us to generate reports.",
    "time": "6 years ago",
    "rating": 1,
    "reviewerName": "Verified Reviewer",
    "source": "Capterra"
  },
  {
    "title": "Easy to use with good GUI",
    "content": "Comments:\n  I am used it for last 8 month and I am satisfied with deskotop vesrion.\n\n\n    \n\n\n    Pros:\n  Best GUI with almost functionality and feature. you can see all your details and generate token.\n    \n\n\n    Cons:\n  Keke app are need update on regular basis, so that irritateing.",
    "time": "6 years ago",
    "rating": 5,
    "reviewerName": "Verified Reviewer",
    "source": "Capterra"
  },
  {
    "title": "Free trial is a demo and onboarding is super tedious",
    "content": "Comments:\n  No way to use a subset of features. Onboarding requires filling 25 sheets even if you are looking to use a subset of features.\n\n\n    \n\n\n    Pros:\n  Looks and feels nice. Has a lot of relevant features.\n    \n\n\n    Cons:\n  No self serve set up and onboarding is extremely time consuming. Further there's no way to use parts of the product before wider rollout.\n\n The free trial is just a demo with fake data. It's not a free trial. The sales team refuses to acknowledge this and the website is also misleading by saying that there is a free trial. \n\nOn top of that the sales team will guilt trip saying other alternatives are giving false hope and promises by giving actual free trials and self serve set up.",
    "time": "3 years ago",
    "rating": 1,
    "reviewerName": "Verified Reviewer",
    "source": "Capterra"
  },
  {
    "title": "Best Software for HR, Admin & Accounting Process",
    "content": "Pros:\n  Being in the marketing field, i have to travel to the clients, so from anywhere i can logged in to Keka, that's the best thing. Also, i can check salary slips, tax or other deductions in Keka itself, that's super cool.\n    \n\n\n    Cons:\n  There is nothing to dislike about keka at the moment, as far as it makes life easy for employees and HR/Admin/Account department, it must be in use for every company.",
    "time": "6 years ago",
    "rating": 5,
    "reviewerName": "Shubham",
    "source": "Capterra"
  },
  {
    "title": "All in one HR platform",
    "content": "Comments:\n  My overall experience has been great.\n\n\n    \n\n\n    Pros:\n  This platform is extremely easy to use and it enables me to manage all my HR activities\n    \n\n\n    Cons:\n  Sometimes the website takes long to load.",
    "time": "3 years ago",
    "rating": 4,
    "reviewerName": "Jahnvi",
    "source": "Capterra"
  },
  {
    "title": "Great Compression Software",
    "content": "Comments:\n  For a basic run-of-the-mill quick archive, I typically just use the MacOS compression tool. Sometimes I have a need to compress things more specialized, or they may be a very large file. Keka handles these special cases like a champ. I wonder if it's possible to replace the standard MacOS compressor with Keka? I've never thought to until writing this review.\n\n\n    \n\n\n    Pros:\n  So many options for compression! It's nice to go into the advanced settings and customize nearly every aspect of compression.\n    \n\n\n    Cons:\n  I sometimes forget to use it. It might be nice to have the ability to make it the \"default\" compressor in MacOS.",
    "time": "6 years ago",
    "rating": 5,
    "reviewerName": "Doug",
    "source": "Capterra"
  }
]